{"Review1": "The authors convincingly demonstrate rotational asymmetry in human centrosome centrioles and a contribution of LRRCC1 to cilium assembly and ciliary signaling. Overall the data is of high quality and mostly support the conclusions. There are a few points, however, that need to be addressed:

1) Does LRRCC1 affect centriole assembly? Is there a change in centriole number in the partial KO lines or after RNAi? This is an obvious question when analyzing the function of a centriole component and is also an important control when claiming cilium assembly defects. The authors should quantify centriole number in mitotic cells.

2) Considering the mild phenotypes after partial depletion of LRRCC1, could the authors use RNAi in the KO cell lines to achieve stronger depletion and more robust phenotypes?

3) Figure 5. Changes in centriole length: were these measurements done at specific cell cycle stages? Can the authors exclude that cell cycle effects in cells with reduced LRRCC1 levels may cause differences in measured centriole length? Related: is mitotic progression normal in these cells? Delayed mitotic progression was shown to also cause centriole elongation (e.g. doi: 10.1083/jcb.201910019). Since full knockout seem to prevent cell growth, it is possible that partial KO may also cause proliferation defects. FACS analysis and monitoring the timing of mitotic progression would address this.",
"Review2": "The data appear too preliminary for immediate publication in eLife. Nevertheless, the subject is intriguing and if authors could provide a cleaner evidence of LRRCC1 and C2CD3 localization, show how depletion of LRRCC1 affects centriole, appendage and cilia structure, the manuscript would be suitable for publication.

Point 1. Expansion microscopy is a powerful imaging approach. However, it is used here to determine localization of a relatively uncharacterized protein, using uncharacterized antibodies. This is risky. For instance: In figure 5 c-e, the authors judge the arrangement of Cep164 to classify centrosomes into 'normal, abnormal, and missing'. This characterization is made based on uneven distribution of Cep164 signals. However, if this criterion is to be extended to acetylated tubulin signal across all expansion images, many of control centrioles (Figure 1c, centriole2 and 3, Figure 3, centriole in b, 1.1 and 1.9 centrioles in Figure 6 f) must also be deemed 'aberrant', due to distortions, uneven spacings between MT blades etc. Clearly, expansion microscopy has its pitfalls.

There are also huge inconsistencies in the pattern and a great variability in the intensity of the LRRCC1 signals between figures and figure panels. For instance, in non-averaged images of expanded centrioles, LRRCC1 can be found in centriole's lumen, in association with MT wall, and in association with variable number of MT blades. In Figure 2b, and 1 b, LLRRCC1 signal is even associated with procentriole's proximal end. How much of the LLRRCC1 signal is indeed specific? The situation seems even more dramatic with C2CD3 data, where some of the signals lie entirely outside the centriole (for instance in 1.9 clone, Figure 6F). Can authors comment on how LRRCC1 and C2CD3 signals can protrude and be localized beyond centriole wall? Previous work (PMID: 30988386, PMID: 29789620) shows C2CD3 to be centered within centriole distal end, and not asymmetric.

It would be critical to use an additional super resolution microscopy technique to re-analyze the localization of LRRCC1 and C2CD3 in non-expanded samples and not to rely solely on expansion microscopy.

Point 2. It is not stated in the manuscript how and whether axial and lateral shifts between different channels were corrected? Was such correction done before image averaging or before image assembly?

Instead of showing averaged data, panels showing more individual examples of horizontally and vertically oriented centrioles would be more instructive. Additional supplemental figures could be assembled for this purpose, at least for the purpose of evaluation.

Point 3. Quantification of LRRCC1 levels in CRISPR clones (Figure 4 a) does not reflect centriole-associated levels of LRRCC1. It reflects the loss of pericentrosomal (satellite) population of LRRCC1, which is the most abundant. Quantification of the centriole bound LCCRR1 needs to be provided instead. Are centrosomal levels of LRRCC1 in 1.1, 1.2, and 1.9 CRISPR clones (Figure 4 a) decreased in comparison to the ones from nocodazole -treated cells (Figure 1A)? In addition, higher resolution images of LRRCC1 in CRISPR clones have not been provided to illustrate where the leftover protein is localized in CRISPR 1.1, 1.2, and 1.9 clones.

How can authors exclude the possibility that loss of the pericentrosomal population of LRRCC1 affects ciliation and ciliary signaling?

Point 4. Between 8 independent experiments conducted in wt RPE-1 cells, the percentage of centrioles with 'abnormal or missing' arrangement of Cep164 varies from ~0% – 40% (Figure 5C). This is a large variability since almost all wt RPE-1 cells can form a cilium (Figure 4b). In my view, this means either that the variability in Cep164 signal is introduced experimentally, or that it is physiological and cannot be used as a measure for ciliation. Indeed, previous super-resolution analysis has demonstrated that, although distal appendage proteins display characteristic pattern around centrioles, their levels on individual appendages can vary under physiological conditions (PMID: 30824690, PMID: 29789620). Therefore, significance of the data from Figure 5 c-e is unclear. Besides, additional appendage proteins (such as Cep83 and SCLT1, for instance) should be analyzed to reach a conclusion about distal appendage organization and number.

Point 5. The authors propose that LRRCC1 cooperates with C2CD3 in organization of distal centriole ends. However, partial reduction in LRRCC1 leads to elongated centrioles only in 1.9 CRISPR clone and not in other two clones, but it is unclear why, as differences between the centrosomal levels of LRRCC1 in CRISPR clones do not seem large enough to explain this difference. Increased centriole length in clone 1.9 could also be non-specific due to clonal variation, and it is unclear whether it is relevant. Especially, because both clones 1.1 and 1.9 seem to show similar defects in ciliation and Cep164 assembly.

To prove and understand what type of centriolar structural defects occur after LRRCC1 depletion, extensive ultrastructural analysis would need to be conducted. Perhaps LRRCC1 could be further depleted by siRNA in LRRCC1- CRISPR clones to generate more penetrant phenotypes?

Point 6. Figure 7. More evidence of LRRCC1/C2CD3 colocalization needs to be provided. Why is majority of C2CD3 signal colocalized with centriole MTs?",

"Review3": "Critical to the central points of the paper are the asymmetric localization of LRRCC1 and C2CD3 at the distal centriole. It is not clear whether the expansion in expansion microscopy is always isotropic and anisotropic expansion could conceivably skew protein localization to appear asymmetric. Could an orthogonal superresolution method, such as 3D-SIM/STED/STORM be used to confirm asymmetry of LRRCC1 or C2CD3? Additionally, could performing 3D-reconstruction image analysis of LRRCC1/C2CD3 with a distal appendage component or another symmetric sub-component of the distal centriole is critical rule out potential artifacts that could be due to anisotropic expansion during U-ExM? The authors imaged OFD1 or CEP290 using U-ExM (fluorescent intensity quantification data are presented in Supplementary Figure S3, but no images are shown). Further confidence in the LRRCC1 conclusions would be garnered by data indicating that these proteins are symmetrically localized at the distal centriole.

The authors report that their results 'demonstrate that rotational asymmetry is a conserved ancient property of centrioles.' However, the basal foot is a previously described rotational asymmetry present in animal cells, no? Indeed, the basal foot seems to be anticorrelated with the localization of LRRCC1. The authors examine distal appendage formation in some depth. Is basal foot formation or location compromised in LRRCC1 depleted cells?

Quantitation of depletion of LRRCC1 is done by light microscopy. The remaining population, although quantitated, is not characterized spatially with any high degree of resolution. Should one subcellular population (centriolar versus satellite) be preferentially depleted by the reduction in LRRCC1 levels, one population might be implicated in the biological functions of LRRCC1. Where is the residual LRRCC1 staining in the CRISPR/Cas9 generated clones? For example, figure 4a would benefit from U-ExM and quantification of fluorescence intensity specifically at centrioles to determine if the centriolar pool of LRRCC1 is disrupted in the hypomorphs, as surmised by the authors.

It is curious that the authors have been unable to generate null mutations in LRRCC1. RPE1 cells fail to proliferate in the presence of centrinone, possibly hinting at a critical role for LRRCC1 in centriole duplication. Is under duplication or delayed duplication of centrioles observed in LRRCC1 depleted cells?

Relatedly, were null mutations in LRRCC1 generated in HEK 293 cells?

In the discussion, the authors speculate at some length about a role of LRRCC1 in the formation of the ciliary gate, given that LRRCC1 depletion inhibits the ciliary localization of Smoothened. However, one component of the ciliary gate, CEP290, is not reported to be altered in LRRCC1 knockdown. Can the authors examine the dependence of ciliary gate components required for Smoothened localization to cilia in the LRRCC1 knockdown cells?

I recognize that the rescue experiments were difficult. Could an inducible approach (e.g., TetOne system) be attempted? Rescue may help delineate which of the variably penetrant phenotypes are due to downregulation of LRRCC1 and which to other factors. For example, the authors observe a mild increase in centriole length in clone 1.9, but not in clone 1.1. The authors conclude that the slightly lower levels of LRRCC1 in clone 1.9 account for the difference. However, an alternative possibility is that clone 1.9 has another genetic or epigenetic variation that accounts for this incompletely penetrant phenotype."}
